[
    {
        "title": "Extraction 2",
        "release_date": "2023-06-09",
        "poster": "/7gKI9hpEMcZUQpNgKrkDzJpbnNS.jpg",
        "adult_content": false,
        "description": "Tasked with extracting a family who is at the mercy of a Georgian gangster, Tyler Rake infiltrates one of the world's deadliest prisons in order to save them. But when the extraction gets hot, and the gangster dies in the heat of battle, his equally ruthless brother tracks down Rake and his team to Vienna, in order to get revenge."
    },
    {
        "title": "Fast X",
        "release_date": "2023-05-17",
        "poster": "/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
        "adult_content": false,
        "description": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever."
    },
    {
        "title": "Spider-Man: Across the Spider-Verse",
        "release_date": "2023-05-31",
        "poster": "/8Vt6mWEReuy4Of61Lnj5Xj704m8.jpg",
        "adult_content": false,
        "description": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most."
    },
    {
        "title": "Knights of the Zodiac",
        "release_date": "2023-04-27",
        "poster": "/qW4crfED8mpNDadSmMdi7ZDzhXF.jpg",
        "adult_content": false,
        "description": "When a headstrong street orphan, Seiya, in search of his abducted sister unwittingly taps into hidden powers, he discovers he might be the only person alive who can protect a reincarnated goddess, sent to watch over humanity. Can he let his past go and embrace his destiny to become a Knight of the Zodiac?"
    },
    {
        "title": "The Flash",
        "release_date": "2023-06-13",
        "poster": "/rktDFPbfHfUbArZ6OOOKsXcv0Bm.jpg",
        "adult_content": false,
        "description": "When his attempt to save his family inadvertently alters the future, Barry Allen becomes trapped in a reality in which General Zod has returned and there are no Super Heroes to turn to. In order to save the world that he is in and return to the future that he knows, Barry's only hope is to race for his life. But will making the ultimate sacrifice be enough to reset the universe?"
    },
    {
        "title": "John Wick: Chapter 4",
        "release_date": "2023-03-22",
        "poster": "/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg",
        "adult_content": false,
        "description": "With the price on his head ever increasing, John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes."
    },
    {
        "title": "The Super Mario Bros. Movie",
        "release_date": "2023-04-05",
        "poster": "/qNBAXBIQlnOThrVvA6mA2B5ggV6.jpg",
        "adult_content": false,
        "description": "While working underground to fix a water main, Brooklyn plumbers—and brothers—Mario and Luigi are transported down a mysterious pipe and wander into a magical new world. But when the brothers are separated, Mario embarks on an epic quest to find Luigi."
    },
    {
        "title": "Indiana Jones and the Dial of Destiny",
        "release_date": "2023-06-28",
        "poster": "/Af4bXE63pVsb2FtbW8uYIyPBadD.jpg",
        "adult_content": false,
        "description": "Finding himself in a new era, approaching retirement, Indy wrestles with fitting into a world that seems to have outgrown him. But as the tentacles of an all-too-familiar evil return in the form of an old rival, Indy must don his hat and pick up his whip once more to make sure an ancient and powerful artifact doesn't fall into the wrong hands."
    },
    {
        "title": "Elemental",
        "release_date": "2023-06-14",
        "poster": "/8riWcADI1ekEiBguVB9vkilhiQm.jpg",
        "adult_content": false,
        "description": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common."
    },
    {
        "title": "Avatar: The Way of Water",
        "release_date": "2022-12-14",
        "poster": "/t6HIqrRAclMCA60NsSmeqe9RmNV.jpg",
        "adult_content": false,
        "description": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure."
    },
    {
        "title": "Transformers: Rise of the Beasts",
        "release_date": "2023-06-06",
        "poster": "/gPbM0MK8CP8A174rmUwGsADNYKD.jpg",
        "adult_content": false,
        "description": "When a new threat capable of destroying the entire planet emerges, Optimus Prime and the Autobots must team up with a powerful faction known as the Maximals. With the fate of humanity hanging in the balance, humans Noah and Elena will do whatever it takes to help the Transformers as they engage in the ultimate battle to save Earth."
    },
    {
        "title": "Guy Ritchie's The Covenant",
        "release_date": "2023-04-19",
        "poster": "/kVG8zFFYrpyYLoHChuEeOGAd6Ru.jpg",
        "adult_content": false,
        "description": "During the war in Afghanistan, a local interpreter risks his own life to carry an injured sergeant across miles of grueling terrain."
    },
    {
        "title": "My Fault",
        "release_date": "2023-06-08",
        "poster": "/w46Vw536HwNnEzOa7J24YH9DPRS.jpg",
        "adult_content": false,
        "description": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning."
    },
    {
        "title": "Through My Window: Across the Sea",
        "release_date": "2023-06-23",
        "poster": "/dAyJqJ8KoglZysttC6BfVmDFQUt.jpg",
        "adult_content": false,
        "description": "After a year of long-distance, Raquel and Ares reunite on a steamy beach trip. Faced with fresh flirtations and insecurities, will their love prevail?"
    },
    {
        "title": "Nimona",
        "release_date": "2023-06-23",
        "poster": "/8havBo9m3vZvj5XbJffcrmpgjnx.jpg",
        "adult_content": false,
        "description": "A knight framed for a tragic crime teams with a scrappy, shape-shifting teen to prove his innocence. But what if she's the monster he's sworn to destroy?"
    },
    {
        "title": "Dungeons & Dragons: Honor Among Thieves",
        "release_date": "2023-03-23",
        "poster": "/A7AoNT06aRAc4SV89Dwxj3EYAgC.jpg",
        "adult_content": false,
        "description": "A charming thief and a band of unlikely adventurers undertake an epic heist to retrieve a lost relic, but things go dangerously awry when they run afoul of the wrong people."
    },
    {
        "title": "Guardians of the Galaxy Vol. 3",
        "release_date": "2023-05-03",
        "poster": "/r2J02Z2OpNTctfOSN1Ydgii51I3.jpg",
        "adult_content": false,
        "description": "Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them."
    },
    {
        "title": "Kandahar",
        "release_date": "2023-05-25",
        "poster": "/lCanGgsqF4xD2WA5NF8PWeT3IXd.jpg",
        "adult_content": false,
        "description": "After his mission is exposed, an undercover CIA operative stuck deep in hostile territory in Afghanistan must fight his way out, alongside his Afghan translator, to an extraction point in Kandahar, all whilst avoiding elite enemy forces and foreign spies tasked with hunting them down."
    },
    {
        "title": "Extraction",
        "release_date": "2020-04-24",
        "poster": "/nygOUcBKPHFTbxsYRFZVePqgPK6.jpg",
        "adult_content": false,
        "description": "Tyler Rake, a fearless mercenary who offers his services on the black market, embarks on a dangerous mission when he is hired to rescue the kidnapped son of a Mumbai crime lord."
    },
    {
        "title": "Barbie",
        "release_date": "2023-07-19",
        "poster": "/cgYg04miVQUAG2FKk3amSnnHzOp.jpg",
        "adult_content": false,
        "description": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans."
    }
]